IRP/src/Catalogs/PrintFormTemplates/PrintFormTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PrintFormTemplates</name>
 <attributes>
  <name>PrintFormType</name>
  <type>
   <types>EnumRef.PrintFormTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintFormVariableType</name>
  <type>
   <types>EnumRef.PrintFormVariableTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Template</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>UseTables</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>UsePrintInformations</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfoPath</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>LimitedAccess</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Tables</name>
  <attributes>
   <name>Name</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>Expression</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>RepeatingArea</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>LineStart</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>LineEnd</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Parameters</name>
  <attributes>
   <name>Name</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>Table</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>Expression</name>
   <type>
    <types>String</types>
   </type>
  </attributes>
  <attributes>
   <name>ToDelete</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>HideEmpty</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AccessGroups</name>
  <attributes>
   <name>Group</name>
   <type>
    <types>CatalogRef.AccessGroups</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/PrintFormTypes/PrintFormTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PrintFormTypes</name>
 <enumValues>
  <name>TXT</name>
 </enumValues>
 <enumValues>
  <name>MXL</name>
 </enumValues>
 <enumValues>
  <name>FormattedText</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/PrintFormTemplates/ManagerModule.bsl
// Get print form.
// 
// Parameters:
//  Template - CatalogRef.PrintFormTemplates - Template
//  Source - AnyRef - Source
//  ReturnAsSpreadsheet - Boolean - Return as spreadsheet
// 
// Returns:
//  SpreadsheetDocument - Get print form
Function GetPrintForm(Template, Source, ReturnAsSpreadsheet=False) Export
	
	If Template.PrintFormType = Enums.PrintFormTypes.TXT Then
		Return GetPrintForm_TXT(Template, Source, ReturnAsSpreadsheet);
		
	EndIf;
	
	Return New SpreadsheetDocument;
	
EndFunction

// Get parameter value.
// 
// Parameters:
//  Expression - String - Expression
//  Source - AnyRef - Source
// 
// Returns:
//  String
Function GetParameterValue(Val Expression, Val Source) Export
	
	Result = "";
	
	SetSafeMode(True);
	Execute(Expression);
	
	Return String(Result);

EndFunction

// Get print form TXT.
// 
// Parameters:
//  Template - CatalogRef.PrintFormTemplates - Template
//  Source - AnyRef - Source
//  ReturnAsSpreadsheet - Boolean - Return as spreadsheet
// 
// Returns:
//  String, SpreadsheetDocument - Get print form
Function GetPrintForm_TXT(Template, Source, ReturnAsSpreadsheet)
	
	TXT_Template = Template.Template.Get();
	If TypeOf(TXT_Template) <> Type("String") Then
		TXT_Template = "";
	EndIf;

	For Each TemplateParameter In Template.Parameters Do
		ParameterValue = GetParameterValue(TemplateParameter.Expression, Source);
		TXT_Template = StrReplace(TXT_Template, TemplateParameter.Name, ParameterValue);
	EndDo;
	
	If ReturnAsSpreadsheet Then
		CurrentNum = 0;
		Spreadsheet = New SpreadsheetDocument;
		Spreadsheet.FitToPage = True;
		LinesArray = StrSplit(TXT_Template, Chars.LF, True);
		For Each LineString In LinesArray Do
			CurrentNum = CurrentNum + 1;
			Spreadsheet.Area(CurrentNum, 1, CurrentNum, 11).Merge();
			Spreadsheet.Area(CurrentNum, 1, CurrentNum, 11).Text = LineString;
			Spreadsheet.Area(CurrentNum, 1, CurrentNum, 11).TextPlacement = SpreadsheetDocumentTextPlacementType.Wrap; 
		EndDo;
		Return Spreadsheet;
	EndIf;

	Return TXT_Template;
	
EndFunction
